benchmark/old_outputs/sieve_fig_low_parallel/lru/2_clients_1_1/2026-04-20T16:31:42-04:00_1_1_1.5.txt
pgbench (19devel)
transaction type: multiple scripts
scaling factor: 1000
query mode: simple
number of clients: 2
number of threads: 2
maximum number of tries: 1
duration: 180 s
number of transactions actually processed: 1736685
number of failed transactions: 0 (0.000%)
latency average = 0.207 ms
initial connection time = 2.037 ms
tps = 9648.351737 (without initial connection time)
SQL script 1: pgscripts/uniform_select.sql
 - weight: 1 (targets 50.0% of total)
 - 868484 transactions (50.0% of total)
 - number of transactions actually processed: 868484 (tps = 4824.961988)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.085 ms
 - latency stddev = 0.017 ms
SQL script 2: pgscripts/uniform_update.sql
 - weight: 1 (targets 50.0% of total)
 - 868077 transactions (50.0% of total)
 - number of transactions actually processed: 868077 (tps = 4822.700853)
 - number of failed transactions: 0 (0.000%)
 - latency average = 0.329 ms
 - latency stddev = 0.313 ms
ratio: .9280482088094156